# -*- coding: utf-8 -*-
conference_about = '''AI-технологии открывают уникальные возможности для бизнеса. Инструменты искусственного интеллекта и анализа больших данных позволяют оптимизировать производственные процессы, повысить доход, улучшить качество услуг и многое другое.

       <b>Что даст бизнесу AI?</b>

Работа с большим объёмом данных.
Прогнозирование спроса и поведения клиента.
Повышение качества обслуживания.
Разработка решений в критических ситуациях.
Контроль предприятия и много чего еще.
В ходе AI Conference 2018 ведущие зарубежные и российские эксперты обсудят круг вопросов, связанных с использованием инновационных технологий. Будут представлены успешные кейсы.

<b>Среди основных вопросов, которые будут обсуждаться:</b>

- Возможности ИИ для оптимизации бизнеса, увеличения прибыли и повышения качества предоставления услуг.
- Практическое применение существующих инструментов AI в маркетинге, логистике, торговле, производстве, финансовой сфере и других областях.
- Грамотная интеграция ИИ в уже существующий бизнес.
- Новые разработки в сфере ИИ.
- Анализ и прогноз развития рынка на ближайшее будущее.

Спикеры AI Conference презентуют новые разработки индустрии, дадут практические советы по корректной интеграции AI-инструментов в бизнес, обсудят текущее состояние рынка и тенденции его развития.
'''

wifi_text ='''<b>Название сети: </b> Newsroom
<b>Пароль: </b> newsroom
'''


program_json = [{"id": 1,
                 "speaker": "Олег Данильченко",
                 "speaker_position": "Руководитель центра компетенции по прикладному анализу данных",
                 "speaker_company": "PwC в России",
                 "time": "10:00-10:15",
                 "title": "Вступительное слово модератора",
                 "html_text": '''<code>10:00-10:15</code>
<b>Олег Данильченко</b>
Руководитель центра компетенции по прикладному анализу данных
PwC в России
<b>Вступительное слово модератора</b>'''},

                 {"id": 2,
                  "speaker": "Евгений Колесников",
                  "speaker_position": "Руководитель направления «Большие данные и машинное обучение»",
                  "speaker_company": "«Инфосистемы Джет»",
                  "time": "10:15-10:40",
                  "title": "Как Machine Learning предсказывает потребность компании в ИТ-мощностях. Кейс",
                  "description": "Как e-commerce, банкам и страховым исключить сбои и «падения» из-за высокой нагрузки на ИТ-мощности? Представим кейс из большого e-commerce: устойчивая модель прогнозирует изменение нагрузки на ИТ-ресурсы в зависимости от роста/снижения бизнес-показателей и различных факторов (акций, распродаж и т. д.), а также повышает бизнес-результаты.",
                  "html_text": '''<code>10:15-10:40</code>
<b>Евгений Колесников</b>
Руководитель направления «Большие данные и машинное обучение»
«Инфосистемы Джет»
<b>Как Machine Learning предсказывает потребность компании в ИТ-мощностях. Кейс</b>
Как e-commerce, банкам и страховым исключить сбои и «падения» из-за высокой нагрузки на ИТ-мощности? Представим кейс из большого e-commerce: устойчивая модель прогнозирует изменение нагрузки на ИТ-ресурсы в зависимости от роста/снижения бизнес-показателей и различных факторов (акций, распродаж и т. д.), а также повышает бизнес-результаты.'''},

                {"id": 3,
                 "speaker": "Илья Украинец",
                 "speaker_position": "Руководитель направления по привлечению пользователей",
                 "speaker_company": "ГК «Везёт»",
                 "time": "10:40-11:00",
                 "title": "Когда чат-бот становится бизнес-ассистентом",
                 "description": "Мы поговорим о том, как в последние годы боты-«говорилки» превратились в умных ассистентов и научились решать настоящие задачи бизнеса: от приема заявок до автоматизации внутренних процессов. Мы обсудим интеграцию чат-ботов в бизнес-среду: типы задач для ботов, способы найти требующие автоматизации бизнес-процессы и то, какие боты станут востребованы в ближайшие 3 года.",
                 "html_text": '''<code>10:40-11:00</code>

<b>Илья Украинец</b>

Co-founder of Addi
Руководитель направления по привлечению пользователей ГК "Везёт"

<b>"Когда чат-бот становится бизнес-ассистентом"</b>

Мы поговорим о том, как в последние годы боты-«говорилки» превратились в умных ассистентов и научились решать настоящие задачи бизнеса: от приема заявок до автоматизации внутренних процессов. Мы обсудим интеграцию чат-ботов в бизнес-среду: типы задач для ботов, способы найти требующие автоматизации бизнес-процессы и то, какие боты станут востребованы в ближайшие 3 года'''},
                {"id": 4,
                 "speaker": "Александр Ханин",
                 "speaker_position": "CEO",
                 "speaker_company": "VisionLabs",
                 "time": "11:00-11:25",
                 "title": "Распознавание и анализ лиц для применения в ритейле и финансовой сфере",
                 "description": "В ходе доклада будут рассмотрены примеры реальных кейсов внедрения биометрической идентификации, а также возможные сложности, требуемые ресурсы и что можно получить в стратегической перспективе от внедрения технологии. Поговорим об автоматизации процессов подтверждения личности клиентов в существующих каналах обслуживания, а также о переходе на удаленную идентификацию клиентов в дистанционных каналах обслуживания.",
                 "html_text": '''<code>11:00-11:25</code>

<b>Александр Ханин</b>

CEO
VisionLabs

<b>"Распознавание и анализ лиц для применения в ритейле и финансовой сфере"</b>

В ходе доклада будут рассмотрены примеры реальных кейсов внедрения биометрической идентификации, а также возможные сложности, требуемые ресурсы и что можно получить в стратегической перспективе от внедрения технологии. Поговорим об автоматизации процессов подтверждения личности клиентов в существующих каналах обслуживания, а также о переходе на удаленную идентификацию клиентов в дистанционных каналах обслуживания.'''},
                {"id": 5,
                 "time":"11:25-11:50",
                 "html_text":'''<code>11:25-11:50</code>

<b>Станислав Кладов</b>

Архитектор Клиентского центра IBM в Москве

IBM

<b>"Как дополненный интеллект от IBM помогает бизнесу"</b>

В то время как многие гонятся за полной заменой человека в некоторых областях деятельности, давайте немного отступим в сторону и рассмотрим концепцию дополненного интеллекта. В ходе доклада эксперт расскажет о том, как IBM помогает создавать помощников специалистам в различных областях бизнеса, каких подводных камней стоит ожидать и к чему это может привести.'''},

                {"id": 6,
                 "time":"11:50-12:10",
                 "html_text":'''<code>11:50-12:10</code>

<b>Кирилл Петров</b>

Основатель и управляющий директор

Just AI

<b>"Чат-боты на естественном языке: инструментарий для разработчиков и бизнеса"</b>

Будут рассмотрены следующие вопросы:

Рассмотрение решений ключевых задач бизнеса на примере платформы для разработки умных чат-ботов: как быстро создать бота, отладить его функции, обучить пониманию естественного языка.
Построение сценариев поведения бота.
Кейсы внедрения чат-ботов в различных отраслях.'''},

                {"id": 7,
                 "time":"12:10-12:35",
                 "html_text":'''
<code>12:10-12:35</code>

<b>Дмитрий Коробченко</b>

Инженер в области машинного обучения

NVIDIA

<b>"Deep learning: обзор технологии и примеров применения"</b>

В сердце современного искусственного интеллекта – глубокие нейронные сети. Сегодня они помогают нам с успехом решать задачи машинного зрения, обработки естественного языка и интеллектуального анализа других типов данных. Кроме того, та же технология обучения глубоких нейронных сетей оказалась пригодна для решения творческих задач: синтеза уникального контента из некоторого концепта или идеи. В докладе будет рассказано, как работают и обучаются современные нейронные сети, что такое Deep Learning и где это применяется.'''},

                {"id": 8,
                 "time":"12:35-13:00",
                 "html_text":'''<code>12:35-13:00</code>

<b>Михаил Беляев</b>

Научный сотрудник, руководитель группы разработки алгоритмов в проекте «CoBrain-Аналитика»

Сколтех

<b>"Глубокое обучение для анализа данных нейровизуализации"</b>

При анализе медицинских изображений решается целый класс задач машинного обучения, включая сегментацию, классификацию, поиск и синтез медицинских изображений. Несколько ключевых характеристик выборок данных медицинских изображений существенно ограничивают использование классических методов глубокого обучения, разработанных для анализа двухмерных изображений. Прежде всего, высокая размерность данных сопровождается крайне низким объемом обучающей выборки, а использование методов аугментации данных существенно ограничено. Кроме того, большой размер 3D-изображений сам по себе накладывает определенные ограничения и приводит к разработке специфичных архитектур свёрточных сетей. Наконец, высокая инструментальная вариабельность данных существенно влияет на результат анализа. В докладе мы обсудим использование методов глубокого обучения для решения подобных задач и дадим несколько примеров проектов по анализу данных нейровизуализации.'''},

                {"id": 9,
                 "time":"13:00-14:00",
                 "html_text":'''<code>13:00-14:00</code>

<b>Дискуссионная панель "Применение AI-технологий в банковской сфере"</b>

<i>МОДЕРАТОР</i>

Роман Давыдов

Инвестиционный банкир, основатель

SKOLKOVO Private Banking & Wealth Management Club

<i>СПИКЕР</i>

Андрей Оберемок

Управляющий Директор по данным и развитию технологий Big Data и AI в блоке «Корпоративный бизнес»

ПАО «Сбербанк»

<i>СПИКЕР</i>

Сергей Лукашкин

Директор по управлению проектами цифровой трансформации

Банк ВТБ'''},

                {"id": 10,
                 "time":"14:00-14:50",
                 "html_text":'''<code>14:00-14:50</code>

<b>Кофе-брейк</b>'''},

                {"id": 11,
                 "time":"14:50-15:00",
                 "html_text":'''<code>14:50-15:00</code>

<b>Андрей Оберемок</b>

Управляющий Директор по данным и развитию технологий Big Data и AI в блоке «Корпоративный бизнес»

ПАО «Сбербанк»

<b>Вступительное слово модератора</b>'''},

                {"id": 12,
                 "time":"15:00-15:20",
                 "html_text":'''<code>15:00-15:20</code>

<b>Ростислав Планкин</b>

CEO

Marketingbot

<b>"Mobile Messenger Marketing"</b>

Mobile Messenger Marketing как обязательная часть Digital-стратегии компаний в 2018–2019 гг. Мессенджеры стремятся стать основной точкой входа в Интернет, перспективы развития в России и угроза для поисковых систем «Яндекс» и Google.'''},

                {"id": 13,
                 "time":"15:20-15:40",
                 "html_text":'''<code>15:20-15:40</code>

<b>Георгий Фомичев</b>

Основатель Endurance

<b>"Бизнес и чат-боты. Успешные бизнес-кейсы"</b>

Почему крупные компании уже обратили внимание на чат-ботов.
Как они помогают экономить расходы и увеличивать продажи и индекс удовлетворенности клиентов.
Успешные бизнес-кейсы, метрики, планы развития.'''},

                {"id": 14,
                 "time":"15:40-16:05",
                 "html_text":'''<code>15:40-16:05</code>

<b>Дмитрий Бабаев</b>

Исследователь в Лаборатории по искусственному интеллекту

Сбербанк

<b>"Проблемы текущего поколения глубинных нейронных сетей"</b>

Глубокое обучение нейронных сетей явилось прорывом в развитии систем искусственного интеллекта. Многие задачи, недоступные классическим методам машинного обучения, были решены на уровне, близком к возможностям человека или даже более высоком. Тем не менее, существуют значительные проблемы обучения нейронных сетей, серьезно ограничивающие их применение. Примеры таких проблем: большой объем размеченных данных, необходимый для обучения сети, сложности переноса опыта обученной сети на другие задачи. Спикер подробно остановится на этих проблемах и возможных путях их решения.'''},

                {"id": 15,
                 "time":"16:05-16:25",
                 "html_text":'''<code>16:05-16:25</code>

<b>Алексей Редозубов</b>

Член Президиума Фонда поддержки научных исследований механизмов работы мозга, лечения его заболеваний, нейромоделирования им. академика Н.П. Бехтеревой

<b>"Новый подход к решению задачи сильного обобщения, основанный на современных представлениях о работе мозга"</b>

Современные нейронные сети, применяемые при решении различных задач, базируются на знании о принципах работы мозга начала 20-го века. При этом имеются фундаментальные ограничения, в том числе при обучении и устойчивости работы этих алгоритмов. За последние 20 лет произошло множество значимых открытий в понимании принципов работы мозга, что позволило нам сформировать новую концепцию работы мозга. На ее основе ведутся разработки принципиально нового типа нейросетей, которые позволят работать со смыслом информации, создавать сильные обобщения и сильный ИИ.'''},

                {"id": 16,
                 "time":"16:25-16:50",
                 "html_text":'''<code>16:25-16:50</code>

<b>Дмитрий Сошников</b>

Senior Technical Evangelist в компании

Microsoft

<b>"Решение задач компьютерного зрения на базе технологий Microsoft: от простого к сложному"</b>

Компьютерное зрение – одна из важнейших составляющих ИИ, применяется для решения широкого круга практических задач: от сбора умных данных с видеопотоков камер наблюдения до автоматической генерации тегов на фотографиях. Традиционно внедрение таких технологий требует не только высокой квалификации разработчиков, но и огромных массивов обучающих данных – сотни тысяч примеров и более.

Мы рассмотрим, как задачи компьютерного зрения могут быть реализованы с помощью различных решений от Microsoft: начиная с решения типовых задач на основе когнитивных сервисов, с помощью сервиса custom vision по созданию своих моделей распознавания, а также на основе нейросетей с использованием Cognitive Toolkit. Мы рассмотрим сами технологии и приведём ряд примеров использования распознавания изображений на практике.'''},

                {"id": 17,
                 "time":"16:50-17:15",
                 "html_text":'''<code>16:50-17:15</code>

<b>Александр Белоусов</b>

СЕО, founder

SOLUT

<b>"Индустриальный IoT: технология распознавания движений для повышения эффективности производства"</b>

Со времен изобретения конвейера Генри Фордом производительность физического труда принципиально не менялась. Компания SOLUT разрабатывает проект в сфере индустриального IoT, направленный на анализ эффективности использования рабочего времени сотрудниками, в промышленном сегменте, строительстве, ЖКХ и других отраслях экономики.

Цель проекта – повышение производительности труда представителей рабочих специальностей путем создания носимых устройств, выявляющих простои, критические нарушения техпроцесса и техники безопасности.

Устройства фиксируют активность работника в течение смены с помощью акселерометров и гироскопов и распознают виды деятельности, характерные для каждой конкретной специальности, используя модели, построенные с применением методов машинного обучения.'''},

                {"id": 18,
                 "time":"17:15-17:35",
                 "html_text":'''<code>17:15-17:35</code>

<b>Александр Беренов</b>

Генеральный директор

Inspector Cloud

<b>"Особенности применения компьютерного зрения в бизнес-процессах компаний в ритейле"</b>

Каковы задачи розничных сетей?
Каковы задачи производителей товаров?
Почему розничные сети пока не внедряют мониторинг полочного пространства.
Как FMCG-бренды стали проводниками технологий в ритейле.
Как компьютерное зрение меняет бизнес-процессы для крупнейших FMCG-компаний.'''}


                ]

class Event:
    def __init__(self, event_json):
        self.id = event_json["id"]
        self.time = event_json["time"]
        self.time_from = int(self.time.split('-')[0].split(':')[0])*60+int(self.time.split('-')[0].split(':')[1])
        self.time_to = int(self.time.split('-')[1].split(':')[0])*60+int(self.time.split('-')[1].split(':')[1])
        if "html_text" in event_json:
            self.html_text = event_json["html_text"]

    def __str__(self):
        return self.time + ": " + self.title


class Program:
    def __init__(self, prog_json):
        self.event_list = [Event(event) for event in prog_json]

    def get_event_by_id(self, event_id):
        for event in self.event_list:
            if event.id == event_id:
                return event

    def get_events_by_time(self, period):
        for event in self.event_list:
            if event.time == period:
                return event

